In [2]:
import sqlite3 as sql
import pandas as pd

conn = sql.connect('basketball.sqlite') # create connection object to database
conn

In [4]:
df_games = pd.read_sql('select * from Team', conn) # use connection object and a arbitrary SQL argument with Pandas
df_games.head() # display first five rows of resultant DataFrame

,id,full_name,abbreviation,nickname,city,state,year_founded
0,1610612737,Atlanta Hawks,ATL,Hawks,Atlanta,Atlanta,1949
1,1610612738,Boston Celtics,BOS,Celtics,Boston,Massachusetts,1946
2,1610612739,Cleveland Cavaliers,CLE,Cavaliers,Cleveland,Ohio,1970
3,1610612740,New Orleans Pelicans,NOP,Pelicans,New Orleans,Louisiana,2002
4,1610612741,Chicago Bulls,CHI,Bulls,Chicago,Illinois,1966